export const enum EmployerApplicationDestiny {
  employer = 0,
  agent = 1,
  kupa = 2,
  service = 3,
  compensation_department = 4,
  employee = 5
}

export const SugTakbulLabel = new Map([
  [1, 'שוטף'],
  [2, 'חד פעמי'],
  [3, 'דמי הבראה'],
  [4, 'הפרשים'],
  [5, 'שעות נוספות']]);

export const WorksInSalaryLabel = new Map([
  [0, 'לא רלוונטי'],
  [1, 'חודשי/רגיל'],
  [2, 'שעתי/יומי'],
  [3, 'היעדר שכר'],
  [4, 'עונתי'],
  [5, 'עזיבת עבודה'],
  [6, 'חופשת לידה'],
  [7, 'שמירת הריון'],
  [8, 'חופשה ללא תשלום'],
  [9, 'פטירה'],
  [10, 'עובד החל להפקיד בקופה אחרת'],
  [11, 'מעבר ממשרד למשרד'],
  [12, 'פרישה לפנסיה'],
  [13, 'אחר'],
  [14, 'עובד חדש']]);

export const productTypeLabel = new Map([
  [0, 'אחר'],
  [1, 'קרן פנסיה'],
  [2, 'קופת גמל'],
  [3, 'ביטוח מנהלים'],
  [4, 'ביטוח בריאות'],
  [5, 'פוליסת חיסכון טהור'],
  [6, 'פוליסת סיכון טהור']]);

export const StatusDepositLabel = new Map([
  [0, 'ללא'],
  [1, 'שכיר'],
  [2, 'עצמאי'],
  [3, 'בעל שליטה']]);

export const payTypeLabel = new Map([
  [0, "צ'ק"],
  [1, 'מסב ספקים'],
  [2, 'מסב גמל']]);

export const SentToSafeBoxes = new Map([
  [0, 'ממתין לטיפול'],
  [1, 'ממתין לשליחה'],
  [2, 'שגיאה'],
  [3, 'שגיאה היזון ראשוני'],
  [4, 'עבר היזון ראשוני'],
  [5, 'לא נשלח'],
  [6, 'אין כספת'],
  [7, 'נשלח'],
  [8, 'לא נמצא קובץ']]);




